In [30]:
import pandas as pd


data = pd.read_excel("files/employee.xlsx")
data

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
1        2    1107     Officer          IT  30.0   80000.0
2        3    1203     Officer          HR  28.0       NaN
3        4    1005     Manager          HR  45.0  120000.0
4        5    2123  Office Boy    Accounts  27.0   45000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
15      16    1222     Officer         NaN  25.0       NaN
16      17    2156    Engineer  Production  45.0   89000.0
17      18    2123  Office Boy    Accounts  27.0   45000.0

In [31]:
# filteration using boolean masking (single condition)
filtered_rows = data[data["Salary"] > 80000]
print("Employees with Salary greater than 80000")
filtered_rows

Employees with Salary greater than 80000

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
3        4    1005     Manager          HR  45.0  120000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
16      17    2156    Engineer  Production  45.0   89000.0

In [32]:
data.describe()

          Serial       Emp_ID        Age         Salary
count  18.000000    18.000000  17.000000      15.000000
mean    9.500000  1995.333333  34.294118   97000.000000
std     5.338539  1334.508369   9.719598   36284.589409
min     1.000000  1001.000000  23.000000   45000.000000
25%     5.250000  1108.000000  27.000000   84500.000000
50%     9.500000  1678.500000  30.000000   90000.000000
75%    13.750000  2156.000000  45.000000  105000.000000
max    18.000000  6543.000000  50.000000  200000.000000

In [33]:
# filtering rows based on multiple conditions (single &(and))
filtered_rows = data[(data["Age"] < 30) & (data["Salary"] > 50000)]
print("Employees with age less than 30 AND Salary greater than 50000")
filtered_rows

Employees with age less than 30 AND Salary greater than 50000

    Serial  Emp_ID Designation  Department   Age    Salary
7        8    1001     Officer          IT  25.0   75000.0
10      11    6543     Officer  Production  29.0  100000.0
13      14    1098     Officer          IT  25.0  100000.0

In [34]:
# filtering rows based on multiple conditions (single |(or))
filtered_rows = data[(data["Age"] > 40) | (data["Salary"] > 80000)]
print("Employees with age greater than 40 OR Salary greater than 80000")
filtered_rows

Employees with age greater than 40 OR Salary greater than 80000

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
3        4    1005     Manager          HR  45.0  120000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
16      17    2156    Engineer  Production  45.0   89000.0

In [35]:
# multiple conditions filteration
filtered_rows = data[(data["Age"] > 40) & ((data["Designation"] == "Manager") | (data["Designation"] == "Accountant"))]
print("Employees older than 40 AND designation is (Manager OR an Accountant)")
filtered_rows

Employees older than 40 AND designation is (Manager OR an Accountant)

    Serial  Emp_ID Designation Department   Age    Salary
0        1    1101     Manager   Accounts  50.0  200000.0
3        4    1005     Manager         HR  45.0  120000.0
11      12    3214  Accountant    Account  49.0  123000.0